[{"title":"开博第一篇--总结及牢骚","date":"2019-07-14T12:40:13.000Z","path":"2019/07/14/开博第一篇-总结及牢骚/","text":"欢迎欢迎来到我的博客，感谢hexo以及yilia主题的开发者。作为刚刚毕业的程序员，以后这里就是我的小窝了，我会不定时发我的牢骚以及技术相关的东西。同时希望你能得到你想要的。 概述&nbsp;&nbsp;&nbsp;&nbsp;经过4天断断续续的搞这个博客（平时要上班，只能用零碎的时间），现在总算是达到我心目中的最低标准了。博客搭建只花了一天，但是域名和评论系统一共花了3天时间。但是很难受，评论还是没搞好，手机端倒是能出来但也评论不了，后面等valine实名制通过了用那个，大概下周就有了。后面零零碎碎的样式的东西也会改变，也许你每次来都有新变化哦。&nbsp;&nbsp;&nbsp;&nbsp;下面我就先说说搭建过程以及这段时间的….emmmm…心历路程？ 搭建的心得&nbsp;&nbsp;&nbsp;&nbsp;先说说为什么突然想起自己建一个博客吧。之前逛v2ex的时候无意间看到一个叫“程序员必须要有自己的博客吗”的帖子，进去看了看大佬们的看法，我觉得说得最有道理的一条是:“个人博客有没有必要，跟是不是程序员没有关系，跟你喜不喜欢写东西有关。”的确，即使你不是程序员，你也可以通过网上的教程一步一步搭一个博客，重点是你喜欢写点东西。我就是这样想的，就想有个自己的窝发泻情绪，哪怕只有我自己看。比如现在，哈哈哈哈哈。&nbsp;&nbsp;然后就是看教程，跟着搭，基本没遇到什么问题，就是域名——github pages的建立没搞过有点不太理解，不过照着做完回想起来都还好，如果你真就是给自己看的，你可以不放github上，自己每次看就开本地服务器就行。有了整个架构以后，你可以改主题，比如我现在用的yilia主题，其中你们看到的每个模块也许都要自己重新弄，有的用的三方插件，我后面会写专门的文章来介绍这些。Anyway，现在也算是完成了一个小目标了。 牢骚&nbsp;&nbsp;&nbsp;&nbsp;其实建这个博客有一大部分原因是因为我从内心来说是很孤独的人，有话总憋不住，但是天蝎座，你懂的。所以放在这里吧，情绪也好，孤独也罢，总算是有个地方安放，也许你发现了，这边文章贴的音乐前面讲了一大堆都没唱，也许你进来就把他关了╮(╯▽╰)╭，现在打开听听他说的，就是我现在想说的，哎….什么是对的人呢，也许总在下一个，我没jj那么乐观，至少现在来说。“一个又一个，排队等缘分，前面丢，后面捡，捡到变恋人，丢的变路人。”真的就没有完美的两个人，总会出现问题，但是为什么这么多年还是没能磨合好呢，还是把双方都伤了。“一个就一个 手空着就开车。寂寞就先晾着，坚强是种天份。直到更好的下一个。”下一个真的就能保证比这个好？&nbsp;&nbsp;&nbsp;&nbsp;哎，就这样吧，写不下去了，情绪上头了。（可以听听这首歌，拉到04:30开始） 注意&nbsp;&nbsp;&nbsp;&nbsp;我写了东西从来不马上看第二遍，感觉会很羞耻，啰嗦和语法不通见谅，开心就好，不想束缚自己。","slug":"开博第一篇-总结及牢骚","comments":true,"categories":[{"name":"总结","slug":"总结","permalink":"http://yoursite.com/categories/总结/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"},{"name":"牢骚","slug":"牢骚","permalink":"http://yoursite.com/tags/牢骚/"}]},{"title":"test","date":"2019-07-10T08:51:00.000Z","path":"2019/07/10/test/","text":"基础测试 # 一级标题 斜体 二级标题粗体 三级标题加粗斜体 12system.out.printf(\"多行代码！\"); 三级标题2 试试 分割线+++ 分割线二 完毕 有序列表项1 有序列表项2 二级标题2 无序列表项1 无序列表项2 无序列表项1 无序列表项2 无序列表项1 无序列表项2 一级标题2表格 表头1 表头2 内容11 ** 内容12 ** 内容21 内容22 二级标题 链接示例链接&lt;www.baidu.com&gt;","slug":"test","comments":true,"categories":[{"name":"测试","slug":"测试","permalink":"http://yoursite.com/categories/测试/"}],"tags":[{"name":"test","slug":"test","permalink":"http://yoursite.com/tags/test/"},{"name":"messi","slug":"messi","permalink":"http://yoursite.com/tags/messi/"},{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]},{"title":"Hello World","date":"2019-07-10T06:43:42.194Z","path":"2019/07/10/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","slug":"hello-world","comments":true,"categories":[],"tags":[]}]